---
kind: property
id: P:Autodesk.Revit.DB.ColumnAttachment.Justification
source: html/afea8301-0c8c-32ce-98a0-4962c82d6065.htm
---
# Autodesk.Revit.DB.ColumnAttachment.Justification Property

Identifies the type of justification to apply to this ColumnAttachment.

## Syntax (C#)
```csharp
public ColumnAttachmentJustification Justification { get; }
```